#pip install pyttsx3

import pyttsx3

name = {"Маша": 18, "Саша":83, "Вика": 118, "Наташа":3,"Коля": 27, "Миша":30,"Катя": 1, "Саша":53,}       # это словарь
animals = {"Маша": "Бобик", "Саша":"Бобик", "Вика": "Бобик", "Наташа":"Бобик","Коля": "Бобик", "Миша":"Бобик","Катя": "Бобик", "Саша":"Бобик",}

age = [1,3,1.23, "кот"]          #это список



while True:
    text = input("Введите имя: ")

    engine = pyttsx3.init()
    engine.say(name[text])
    engine.runAndWait()

    print('Возраст:', name[text], 'лет.', 'Живет дома', animals[text], 'зверь')
    print('Сон прекрсен')




